create_clock [get_ports clk] -period 10

set_input_delay 0 [all_inputs]
set_output_delay 0 [all_outputs]